INSERT INTO teachers (
  schoolname,
  email,
  password,
  classname,
  teachername
)
VALUES (
  'エンジニア第８中学校',
  'teacher@example.com',
  '$2a$10$4npqq4mPn8VKS2tnntPlwOoVmB7QQ0ZMkvYNaMekIDbQRZ6ExIzUS',
  '1年6組',
  '三木　真宇須'
);

INSERT INTO tests (
  teacher_id,
  testname,
  startday,
  lastday
)
VALUES (
  1,
  '2学期期末テスト',
  '2025-12-15',
  '2025-12-22'
);

INSERT INTO students (
  teacher_id,
  test_id,
  studentnumber,
  studentname,
  studentpassword
)
VALUES
(1, 1, '01', '生徒01 太郎', 'pass'),
(1, 1, '02', '生徒02 花子', 'pass'),
(1, 1, '03', '生徒03 次郎', 'pass'),
(1, 1, '04', '生徒04 三郎', 'pass'),
(1, 1, '05', '生徒05 美咲', 'pass'),
(1, 1, '06', '生徒06 健太', 'pass'),
(1, 1, '07', '生徒07 彩',   'pass'),
(1, 1, '08', '生徒08 翔',   'pass'),
(1, 1, '09', '生徒09 優',   'pass'),
(1, 1, '10', '生徒10 直樹', 'pass'),
(1, 1, '11', '生徒11 陽菜', 'pass'),
(1, 1, '12', '生徒12 拓海', 'pass'),
(1, 1, '13', '生徒13 結衣', 'pass'),
(1, 1, '14', '生徒14 大輔', 'pass'),
(1, 1, '15', '生徒15 葵',   'pass'),
(1, 1, '16', '生徒16 悠真', 'pass'),
(1, 1, '17', '生徒17 美優', 'pass'),
(1, 1, '18', '生徒18 蓮',   'pass'),
(1, 1, '19', '生徒19 さくら','pass'),
(1, 1, '20', '生徒20 恒一','pass');

INSERT INTO learning_records
(student_id, test_id, learn_day, plan, record)
VALUES
(1, 1, '2025-12-15', '国語：漢字練習／数学：計算問題', '国語:ワーク・数学：ワーク'),
(2, 1, '2025-12-15', '国語：漢字練習／数学：計算問題', '国語：漢字ノート'),
(3, 1, '2025-12-15', '英語：単語暗記／理科：用語確認', '英語：勉強用ノート作成'),
(4, 1, '2025-12-15', '英語：単語暗記／理科：用語確認', '英語、理科：ワーク'),
(5, 1, '2025-12-15', '社会：歴史プリント／数学：文章題', '社会：単語帳'),
(6, 1, '2025-12-15', '社会：歴史プリント／数学：文章題', '数学：塾'),
(7, 1, '2025-12-15', '理科：計算問題／英語：長文', '理科：濃度の計算'),
(8, 1, '2025-12-15', '理科：計算問題／英語：長文', '英語：単語帳'),
(9, 1, '2025-12-15', '数学：ワークP20-21／国語：読解', '数学・国語：ノート作成'),
(10,1, '2025-12-15', '数学：ワークP20-21／国語：読解', '数学：ワーク'),
(11,1, '2025-12-15', '国語：漢字練習／数学：計算問題', '国語:ワーク、数学：ワーク'),
(12,1, '2025-12-15', '英語：単語暗記／理科：用語確認', '英語：単語帳'),
(13,1, '2025-12-15', '社会：歴史プリント／数学：文章題', '国語:ワーク・数学：ワーク'),
(14,1, '2025-12-15', '理科：計算問題／英語：長文', '国語：漢字ノート'),
(15,1, '2025-12-15', '数学：文章題／国語：読解', NULL),
(16,1, '2025-12-15', '英語：単語暗記／社会：地理', '数学：ワークP20-21／国語：読解'),
(17,1, '2025-12-15', '理科：用語確認／数学：計算', NULL),
(18,1, '2025-12-15', '国語：読解／英語：長文','理科：密度の計算'),
(19,1, '2025-12-15', '社会：歴史プリント／理科：復習','社会：オセアニア'),
(20,1, '2025-12-15', '数学：計算問題／国語：漢字', NULL);


INSERT INTO learning_records
(student_id, test_id, learn_day, plan, record)
VALUES
(1, 1, '2025-12-16', '数学：応用問題／英語：文法', NULL),
(2, 1, '2025-12-16', '数学：応用問題／英語：文法', NULL),
(3, 1, '2025-12-16', '国語：作文／社会：歴史', NULL),
(4, 1, '2025-12-16', '国語：作文／社会：歴史', NULL),
(5, 1, '2025-12-16', '理科：実験ノート整理', NULL),
(6, 1, '2025-12-16', '理科：実験ノート整理', NULL),
(7, 1, '2025-12-16', '英語：長文読解', NULL),
(8, 1, '2025-12-16', '英語：長文読解', NULL),
(9, 1, '2025-12-16', '数学：関数／国語：読解', NULL),
(10,1, '2025-12-16', '数学：関数／国語：読解', NULL),
(11,1, '2025-12-16', '社会：地理／英語：単語', NULL),
(12,1, '2025-12-16', '社会：地理／英語：単語', NULL),
(13,1, '2025-12-16', '理科：計算問題', NULL),
(14,1, '2025-12-16', '理科：計算問題', NULL),
(15,1, '2025-12-16', '国語：漢字練習', NULL),
(16,1, '2025-12-16', '国語：漢字練習', NULL),
(17,1, '2025-12-16', '数学：文章題', NULL),
(18,1, '2025-12-16', '数学：文章題', NULL),
(19,1, '2025-12-16', '英語：文法問題', NULL),
(20,1, '2025-12-16', '英語：文法問題', NULL);
